
**Задание**: Напишите программу для поиска индекса максимального элемента массива с использованием рекурсии.

Решение: 
```C#
    class Program
    {
        static int IndexOfMax(int[] array, int index)
        {
            if (index == 0)
            {
                return index;
            }

            var i = IndexOfMax(array, index - 1);
            return array[index] > array[i] ? index : i;
        }

        static void Main(string[] args)
        {
            var a = new[] { 0, 5, 6, 1, 9, 7, 8, 3, 2, 4 };
            Console.WriteLine("Индекс максимального элемента массива: " + IndexOfMax(a, a.Length - 1));
            Console.ReadLine();
        }

```
  