**Задание**: Напишите программу для переворота строки с использованием рекурсии. Строка “abс” переворачивается в “cba”.

Решение

```cs
using System;

class Program
{
    static string Reverse(string s)
    {
        if (string.IsNullOrEmpty(s))
        {
            return s;
        }

		// Берем часть строки начиная со 2 элемента, первый помещаем в конец строки
        return Reverse(s.Substring(1)) + s[0].ToString();
    }

    
    static void Main(string[] args)
    {
        Console.Write("Введите строку: ");
        var inputText = Console.ReadLine();
        Console.WriteLine("Перевернутая строка: " + Reverse(inputText));
        Console.ReadLine();
    }
```

#вопросы_Csharp #задачи_Csharp  #Csharp #рекурсия